# Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших
# двух аргументов\


def my_func():
    num1 = int(input('Enter first number: '))
    num2 = int(input('Enter second number: '))
    num3 = int(input('Enter third number: '))

    return max(my_func)


print(my_func())



